Repository: morvy/cloudflare-r2-for-woocommerce
Catalog: languages/cfr2wc-*.po
Languages: sk_sk

source: Cloudflare R2 for WooCommerce
sk_sk: Cloudflare R2 pre WooCommerce

source: Simple WooCommerce integration to offload downloadable product files to Cloudflare R2
sk_sk: Jednoduchá integrácia WooCommerce pre presun sťahovateľných súborov produktov do Cloudflare R2

source: Cloudflare R2 for WooCommerce requires WooCommerce to be installed and active.
sk_sk: Cloudflare R2 pre WooCommerce vyžaduje nainštalovaný a aktívny WooCommerce.

source: General
sk_sk: Všeobecné

source: Connection
sk_sk: Pripojenie

source: General Settings
sk_sk: Všeobecné nastavenia

source: Configure general download and security settings.
sk_sk: Nakonfigurujte všeobecné nastavenia sťahovania a bezpečnosti.

source: Enable Public Downloads
sk_sk: Povoliť verejné sťahovanie

source: Allow public access to files without WooCommerce authentication (uses custom domain).
sk_sk: Povoliť verejný prístup k súborom bez autentifikácie WooCommerce (používa vlastnú doménu).

source: Check Download Permissions
sk_sk: Kontrolovať oprávnenia na sťahovanie

source: Verify customer has purchased the product before allowing download.
sk_sk: Overiť, že zákazník kúpil produkt pred povolením sťahovania.

source: Use Generic Download Name
sk_sk: Použiť všeobecný názov sťahovania

source: Display "Download" for all files instead of the actual filename.
sk_sk: Zobraziť "Stiahnuť" pre všetky súbory namiesto skutočného názvu súboru.

source: Download URL Expiration
sk_sk: Expirácia URL sťahovania

source: Hours until download link expires (1-720 hours, default 24).
sk_sk: Počet hodín do expirácie odkazu na sťahovanie (1-720 hodín, predvolené 24).

source: Custom Domain
sk_sk: Vlastná doména

source: Your R2 custom domain (e.g., cdn.yourdomain.com). Only used when public downloads are enabled.
sk_sk: Vaša vlastná doména R2 (napr. cdn.vasadomena.sk). Používa sa len pri povolenom verejnom sťahovaní.

source: Enable Debug Mode
sk_sk: Povoliť režim ladenia

source: Enable debug logging using WooCommerce logger. Logs will be available in WooCommerce > Status > Logs.
sk_sk: Povoliť logovanie ladenia pomocou WooCommerce logger. Logy budú dostupné v WooCommerce > Stav > Logy.

source: Debug Level
sk_sk: Úroveň ladenia

source: Select the minimum log level to record. Only applies when Debug Mode is enabled.
sk_sk: Vyberte minimálnu úroveň logovania. Platí len pri povolenom režime ladenia.

source: Debug (All messages)
sk_sk: Debug (Všetky správy)

source: Info (Informational messages)
sk_sk: Info (Informatívne správy)

source: Warning (Warning messages)
sk_sk: Varovanie (Varovné správy)

source: Error (Error messages only)
sk_sk: Chyba (Len chybové správy)

source: Critical (Critical errors only)
sk_sk: Kritická (Len kritické chyby)

source: Enter your R2 credentials in the fields below. They will be encrypted using AES-256-GCM and stored securely in your WordPress database.
sk_sk: Zadajte vaše R2 prihlasovacie údaje do polí nižšie. Budú zašifrované pomocou AES-256-GCM a bezpečne uložené vo vašej WordPress databáze.

source: <strong>Advanced:</strong> Edit your %1$s file and define the constants %2$s and %3$s containing your R2 credentials. These will be used instead of database values.
sk_sk: <strong>Pokročilé:</strong> Upravte váš súbor %1$s a definujte konštanty %2$s a %3$s obsahujúce vaše R2 prihlasovacie údaje. Tie budú použité namiesto hodnôt z databázy.

source: R2 Connection Credentials
sk_sk: Prihlasovacie údaje R2 pripojenia

source: Configure your Cloudflare R2 API credentials.
sk_sk: Nakonfigurujte vaše Cloudflare R2 API prihlasovacie údaje.

source: Credentials Storage
sk_sk: Ukladanie prihlasovacích údajov

source: Save to database (encrypted with AES-256-GCM)
sk_sk: Uložiť do databázy (zašifrované pomocou AES-256-GCM)

source: Use wp-config.php constants (unencrypted)
sk_sk: Použiť konštanty wp-config.php (nezašifrované)

source: Example: https://account-id.r2.cloudflarestorage.com (Global) or https://account-id.eu.r2.cloudflarestorage.com (EU)
sk_sk: Príklad: https://account-id.r2.cloudflarestorage.com (Globálne) alebo https://account-id.eu.r2.cloudflarestorage.com (EU)

source: Your R2 API token access key
sk_sk: Váš prístupový kľúč R2 API tokenu

source: Your R2 API token secret key
sk_sk: Váš tajný kľúč R2 API tokenu

source: Bucket Name
sk_sk: Názov bucketu

source: The name of your R2 bucket
sk_sk: Názov vášho R2 bucketu

source: Test Connection
sk_sk: Otestovať pripojenie

source: Test your R2 connection with the credentials entered above.
sk_sk: Otestujte vaše R2 pripojenie s prihlasovacími údajmi zadanými vyššie.

source: Permission denied
sk_sk: Prístup zamietnutý

source: Please fill in all required fields
sk_sk: Prosím vyplňte všetky povinné polia

source: Connection successful! Your credentials are valid.
sk_sk: Pripojenie úspešné! Vaše prihlasovacie údaje sú platné.

source: Connection failed. Please check your credentials.
sk_sk: Pripojenie zlyhalo. Prosím skontrolujte vaše prihlasovacie údaje.

source: Connection error: %s
sk_sk: Chyba pripojenia: %s

source: Select File from R2
sk_sk: Vybrať súbor z R2

source: Navigate:
sk_sk: Navigácia:

source: folder...
sk_sk: priečinok...

source: Select File:
sk_sk: Vyberte súbor:

source: Type to search files in current folder...
sk_sk: Píšte pre vyhľadávanie súborov v aktuálnom priečinku...

source: Selected File
sk_sk: Vybraný súbor

source: File Name:
sk_sk: Názov súboru:

source: Size:
sk_sk: Veľkosť:

source: Path:
sk_sk: Cesta:

source: Cancel
sk_sk: Zrušiť

source: Add to Product
sk_sk: Pridať k produktu

source: Upload File to R2
sk_sk: Nahrať súbor do R2

source: Upload to:
sk_sk: Nahrať do:

source: Click to select file or drag and drop
sk_sk: Kliknite pre výber súboru alebo presuňte myšou

source: Loading...
sk_sk: Načítavam...

source: Error
sk_sk: Chyba

source: No files found
sk_sk: Neboli nájdené žiadne súbory

source: Please select a file
sk_sk: Prosím vyberte súbor

source: Uploading...
sk_sk: Nahrávam...

source: File uploaded successfully
sk_sk: Súbor bol úspešne nahraný

source: Upload failed
sk_sk: Nahrávanie zlyhalo

source: Choose
sk_sk: Vybrať

source: Upload
sk_sk: Nahrať

source: File type not allowed. Please upload a valid file.
sk_sk: Typ súboru nie je povolený. Prosím nahrajte platný súbor.

source: File too large. Maximum size: %s
sk_sk: Súbor je príliš veľký. Maximálna veľkosť: %s

source: File exceeds upload_max_filesize in php.ini
sk_sk: Súbor presahuje upload_max_filesize v php.ini

source: File exceeds MAX_FILE_SIZE in HTML form
sk_sk: Súbor presahuje MAX_FILE_SIZE v HTML formulári

source: File was only partially uploaded
sk_sk: Súbor bol len čiastočne nahraný

source: No file was uploaded
sk_sk: Nebol nahraný žiadny súbor

source: Missing temporary upload folder
sk_sk: Chýba dočasný priečinok pre nahrávanie

source: Failed to write file to disk
sk_sk: Zlyhalo zapisovanie súboru na disk

source: Upload stopped by PHP extension
sk_sk: Nahrávanie bolo zastavené PHP rozšírením

source: Unknown upload error
sk_sk: Neznáma chyba nahrávania

source: Too many uploads. Please wait before uploading more files.
sk_sk: Príliš veľa nahrávaní. Prosím počkajte pred nahrávaním ďalších súborov.

source: No file uploaded
sk_sk: Nebol nahraný žiadny súbor

source: Failed to upload to R2
sk_sk: Zlyhalo nahrávanie do R2

source: Connection successful!
sk_sk: Pripojenie úspešné!

source: Connection failed: %s
sk_sk: Pripojenie zlyhalo: %s

source: You do not have permission to download this file.
sk_sk: Nemáte oprávnenie na stiahnutie tohto súboru.

source: Download Error
sk_sk: Chyba sťahovania

source: Failed to generate download URL. Please contact support.
sk_sk: Zlyhalo generovanie URL sťahovania. Prosím kontaktujte podporu.

source: Cache is still fresh, no sync needed
sk_sk: Cache je stále aktuálna, synchronizácia nie je potrebná

source: Failed to list R2 objects
sk_sk: Zlyhalo listovanie R2 objektov

source: Synced %1$d new files, updated %2$d existing, deleted %3$d obsolete
sk_sk: Synchronizovaných %1$d nových súborov, aktualizovaných %2$d existujúcich, zmazaných %3$d zastaraných

source: Missing required "object" attribute
sk_sk: Chýba povinný atribút "object"

source: Download
sk_sk: Stiahnuť

source: Failed to generate download URL
sk_sk: Zlyhalo generovanie URL sťahovania
